CREATE TABLE type
(
    id   SERIAL PRIMARY KEY,
    name VARCHAR(64) NOT NULL
);

CREATE TABLE product
(
    id           SERIAL PRIMARY KEY,
    name         VARCHAR(128) NOT NULL,
    expired_date DATE,
    price        DECIMAL(10, 2),
    type_id      INT REFERENCES type (id)
);

-- Заполнение таблицы типов
INSERT INTO type (name)
VALUES ('Сыр'),
       ('Молоко'),
       ('Мороженое'),
       ('Замороженные продукты');

-- Заполнение таблицы продуктов
INSERT INTO product (name, expired_date, price, type_id)
VALUES ('Пармезан', '2023-12-01', 500.00, 1),
       ('Голландский сыр', '2023-11-15', 350.00, 1),
       ('Пошехонский', '2023-12-10', 300.00, 1),
       ('Ультрапастеризованное молоко', '2023-12-05', 150.00, 2),
       ('Замороженное мясо', '2024-05-01', 700.00, 4),
       ('Замороженная рыба', '2024-03-20', 550.00, 4),
       ('Замороженные овощи', '2024-02-15', 120.00, 4),
       ('Ванильное мороженое', '2023-10-01', 50.00, 3),
       ('Шоколадное мороженое', '2023-10-01', 55.00, 3),
       ('Клубничное мороженое', '2023-10-01', 60.00, 3);